# Задание 8.01
my_words = ['Максим', 'Юра', 'Петя', 'Вася']
print(my_words[::-1])

# Задание 8.02

cars = [{'Марка': 'BMW', 'Серийный номер': 21312543, 'Год выпуска': 2000},
        {'Марка': 'SEAT', 'Серийный номер': 54645632, 'Год выпуска': 1990},
        {'Марка': 'Audi ', 'Серийный номер': 567567234, 'Год выпуска': 2007},
        {'Марка': 'Geely ', 'Серийный номер': 56756544, 'Год выпуска': 2016},
        {'Марка': 'Peugeot ', 'Серийный номер': 5675674324, 'Год выпуска': 1995},
        {'Марка':' Opel ', 'Серийный номер': 567567234, 'Год выпуска': 1991}]
n = int(input('Введите год выпуска : '))
for x in cars:
    if x['Год выпуска'] >= n:
        print(x)


# Задание 8.03

my_list = {"Лето": "Тепло", "Зима": "Холодно", "Осень": "Дождливо"}
new_list = dict(zip(my_list.values(), my_list.keys()))
print(new_list)


# Задание 8.04

def numbers():
    my_dict = [12, 14, 17, 200, 1, 1, 3, 1, 6, 8]
    rez = {}
    for i in my_dict:
        rez[i] = my_dict.count(i)
    print(f"Кол-во повторений {rez}")


numbers()

